In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# grupby işlemi ile yapmak

In [3]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [4]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [5]:
titanic.groupby(["sex" ,"class"])["survived"].aggregate("mean")

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [6]:
titanic.groupby(["sex" ,"class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [7]:
titanic.groupby(["sex" ,"class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [8]:
#pivot_Table işlemi ile yapmak

In [14]:
titanic.pivot_table("survived" ,index="sex" ,columns= "class")
# burdaki colums o değerlerinde gruplanmasını sağlar

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [12]:
titanic.pivot_table("survived" ,index = "sex" )

        survived
sex
female  0.742038
male    0.188908

In [18]:
titanic[["age"]].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [19]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [21]:
age = pd.cut(titanic["age"] ,[0 ,18 ,90])

In [22]:
age.head

<bound method NDFrame.head of 0      (18.0, 90.0]
1      (18.0, 90.0]
2      (18.0, 90.0]
3      (18.0, 90.0]
4      (18.0, 90.0]
           ...
886    (18.0, 90.0]
887    (18.0, 90.0]
888             NaN
889    (18.0, 90.0]
890    (18.0, 90.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]>

In [23]:
titanic.pivot_table(values = "survived" , index = ["sex" ,age] ,columns ="class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663